app/controllers/api/videos_controller.rb

INSERT INTO "videos" ("title", "description", "uploader_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Test"], ["description", "testing"], ["uploader_id", 1], ["created_at", "2019-04-02 22:59:31.803148"], ["updated_at", "2019-04-02 22:59:31.803148"]]
---
    def create
        @video = Video.new(video_params)
        if @video.save

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "videos" SET "title" = $1, "updated_at" = $2 WHERE "videos"."id" = $3  [["title", "Demo Video"], ["updated_at", "2019-04-02 15:56:09.526383"], ["id", 6]]
---
    def update
        @video = Video.find_by(id: params[:video][:id])
        if @video.update_attributes(video_params)

DELETE FROM "videos" WHERE "videos"."id" = $1  [["id", 6]]
---
    def destroy
        @video = current_user.uploads.find(params[:id])
        @video.destroy